[Threat - Delta-5.63-Exfiltration-UnexpectedOutboundConnectionFromVPNServer - Rule]
action.correlationsearch.detection_type = ebd
action.correlationsearch.annotations = {"mitre_attack":["T1048"],"confidence":2,"impact":3,"likelihood":["2"],"last_reviewed":["24/02/2025"],"lifecycle":["live"],"DeltaId":["S0001"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = Delta-5.63-Exfiltration-UnexpectedOutboundConnectionFromVPNServer
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.drilldown_dashboards = []
action.notable.param.drilldown_searches = [{"name":"All traffic from $src$ during time period","search":"index=$orig_index$ sourcetype=$orig_sourcetype$ src=$src$ \n|  table _time index src dest dest_bunit bytes_out direction action\n|  stats sum(bytes_out) as bytes_out values(dest_bunit) as dest_bunit values(action) as action by src dest direction","earliest_offset":"$info_min_time$","latest_offset":"$info_max_time$"},{"name":"Any other traffic to $dest$ not from $src$","search":"index=$orig_index$ sourcetype=$orig_sourcetype$ dest=$dest$ src!=$src$\n|  table _time index src src_bunit dest bytes_out direction action\n|  stats sum(bytes_out) as bytes_out values(src_bunit) as src_bunit values(action) as action by src dest direction","earliest_offset":"$info_min_time$","latest_offset":"$info_max_time$"},{"name":"Events identified by signature","search":"$drilldown_search$","earliest_offset":"$info_min_time$","latest_offset":"$info_max_time$"}]
action.notable.param.rule_description = Traffic going from $src$ has been seen going to $dest$ which is a destination not expected for this server to be connecting to. Expected destinations would be those owned by the partner running this service for Booker.
action.notable.param.rule_title = Delta-5.63-Exfiltration-UnexpectedOutboundConnectionFromVPNServer
action.notable.param.security_domain = network
action.notable.param.severity = high
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"src","risk_object_type":"system","risk_score":5},{"threat_object_field":"host","threat_object_type":"src"}]
action.risk.param._risk_message = $event_message$
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.secure_zendesk = 1
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 1
alert.suppress.fields = src,dest
alert.suppress.period = 7200s
alert.track = 1
counttype = number of events
cron_schedule = 3 * * * *
description = This is a detection which focuses on outbound connections from the Booker Ivanti VPN server to external services not identified as owned by Delta - This also includes known third party traffic such as OCD who manage this service for Booker.
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.rt_backfill = 1
display.visualizations.custom.mitre_attck_heatmap.mitre_attck_heatmap.hideNull = 0
enableSched = 1
quantity = 0
realtime_schedule = false
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
schedule_window = 5
search = | tstats count values(All_Traffic.dest_bunit) as dest_bunit sum(All_Traffic.bytes_out) as bytes_out sum(All_Traffic.bytes_in) as bytes_in values(All_Traffic.protocol) as protocol values(All_Traffic.direction) as direction values(All_Traffic.action) as action  earliest(_time) as earliestTime latest(_time) as latestTime `summariesonly` from datamodel=Network_Traffic where index="network_booker" sourcetype="cisco:ftd" AND All_Traffic.src_bunit="*psa*" AND All_Traffic.direction="outbound" by All_Traffic.dest All_Traffic.src index sourcetype\
| where isnull(dest_bunit) AND bytes_out > 0\
| rename All_Traffic.* as *\
| ipinfo dest company=true\
| `Delta_drilldown_time(earliestTime, latestTime)`\
|`Delta_ctime(earliestTime)`\
|`Delta_ctime(latestTime)`\
| where isnull(asn_name) OR NOT match(asn_name,"Orange Cyberdefense")\
| eval event_message = "A connection has been seen from ".src." to ".dest." with ".bytes_out." bytes sent. The destination is registered as belonging to ".coalesce(asn_name,company_name)\
| `siem_attributes(index,sourcetype,Delta-5.63-Exfiltration-UnexpectedOutboundConnectionFromVPNServer,1,Delta-5.63-Exfiltration-UnexpectedOutboundConnectionFromVPNServer)`\
| eval drilldown_search="index=\"".index."\" sourcetype=\"".sourcetype."\" src=\"".src."\" dest=\"".dest."\" | table _time src dest action bytes_out "\
|`risk_attributes(index, "Delta-5.63-Exfiltration-UnexpectedOutboundConnectionFromVPNServer")`